/* Task view. */
HSDFSD_TaskName = "Fax Speed Dials";
HSDFPB_TaskName = "Fax Phone Book";
HSDFSD_TaskDescription = "Use the + and - buttons or type the information you want in the Speed Dial memory of your device. Or, use the Address Book to find and add information.";
HSDFPB_TaskDescription = "Fax Phone Book allows you to view and manage the list of contacts in your device.\nUse the + and - buttons to add or remove contacts. You can also use Contacts to find more entries and add them to the list.";

ActionMenuTooltip = "Action Menu";

HSDEntryIndexColumnTitle = "Entry #";
HSDEntryNameColumnTitle = "Name";
HSDEntryPhoneNumberColumnTitle = "Fax Number";
HSDEntryEditActionMenuTitle = "Edit…";
HSDEntryCreateGroupActionMenuTitle = "Create Group…";
EntriesStatusCaption = "%1$d of %2$d entries used";
HSDPrintListButtonTitle = "Print List";
/* Use common localized key instead of plug-in "MoreInfoButtonTitle". */
AddressBookLaunchButtonTooltip = "Launch Fax Address Book";
ContactsLaunchButtonTooltip = "Launch Fax Contacts";
HSDApplyButtonTitle = "Apply Now";

HSDDismissEntryButtonTitle = "Cancel";
HSDConfirmEntryButtonTitle = "Save";

HSDFPB_AddNewContactToolTip = "Add new contact";
HSDFSD_AddNewContactToolTip = "Add new speed dial";
HSDFPB_DeleteSelectedContactToolTip = "Delete the selected contacts or groups";
HSDFSD_DeleteSelectedContactToolTip = "Delete the selected speed dials or groups";
HSDFPB_PrintListButtonToolTip = "Print all contacts stored on this device";
HSDFSD_PrintListButtonToolTip = "Print all speed dials stored on this device";

/* Individual entry panel. */
HSDFPB_IndividualEntryIndexFieldCaption = "Entry (#):";
HSDFSD_IndividualEntryIndexFieldCaption = "Speed Dial (#):";
HSDIndividualEntryNameFieldCaption = "Name:";
HSDIndividualEntryPhoneNumberFieldCaption = "Fax Number:";

/* Group entry panel. */
HSDFPB_GroupEntryIndexFieldCaption = "Entry (#):";
HSDFSD_GroupEntryIndexFieldCaption = "Speed Dial (#):";
HSDGroupEntryNameFieldCaption = "Group Name:";
HSDFSD_GroupEntryItemsDescription = "Select the speed dials that you want to include in this group.";
HSDFPB_GroupEntryItemsDescription = "Select the contacts that you want to add to this group.";

/* More Info panel. */
HSDConfirmMoreInfoButtonTitle = "OK";

/* Contacts panel. */
AddressBookPanelTitle = "Fax Address Book";
ContactsPanelTitle = "Fax Contacts";
HSDDismissContactsButtonTitle = "Close";
HSDConfirmContactsButtonTitle = "Add";

/* Alert dialogs. */
CancelAlertButtonTitle = "Cancel";
RemoveFromGroupAlertButtonTitle = "Remove from Group";
DeleteAlertButtonTitle = "Delete";
ApplyAlertButtonTitle = "Apply";
DontApplyAlertButtonTitle = "Don't Apply";

IncorrectDeviceStateAlertTitle = "Printer is in an error state";
IncorrectDeviceStateAlertMessage = "Please resolve the error condition for the device and try again.";

HSDFSD_InvalidEntryErrorTitle = "Invalid Speed Dial";
HSDFPB_InvalidEntryErrorTitle = "Cannot add contact";
HSDFSD_MissingEntryNameErrorMessage = "The Speed Dial name is missing. Please enter a name for the Speed dial and try again.";
HSDFPB_MissingEntryNameErrorMessage = "The contact name is missing. Enter a name for the contact and try again.";
HSDFSD_MissingEntryPhoneNumberErrorMessage = "The Speed Dial number is missing. Please enter a number for the Speed dial and try again.";
HSDFPB_MissingEntryPhoneNumberErrorMessage = "The contact number is missing. Enter a number for the contact and try again.";
HSDFSD_TooLargeGroupErrorMessage = "The Speed Dial group is too large. Your device supports a maximum of %d entries in a group.";
HSDFPB_TooLargeGroupErrorMessage = "There are too many contacts in the group. Your device supports a maximum of %d entries in a group.";

HSDFSD_DeleteIndividualEntryAlertTitle = "Are you sure you want to delete the Speed Dial for \"%@\"?";
HSDFPB_DeleteIndividualEntryAlertTitle = "Are you sure you want to delete the contact \"%@\"?";
HSDFSD_DeleteIndividualEntryAlertMessage = "The selected Speed Dial appears in one or more groups. Deleting the speed dial will remove it from the Group(s).";
HSDFPB_DeleteIndividualEntryAlertMessage = "The selected contact appears in one or more groups. Deleting the contact will remove it from all groups.";
HSDFSD_DeleteMultipleIndividualEntriesAlertTitle = "Are you sure you want to delete the selected Speed Dials?";
HSDFPB_DeleteMultipleIndividualEntriesAlertTitle = "Are you sure you want to delete the selected contacts?";
HSDFSD_DeleteMultipleIndividualEntriesAlertMessage = "Some of the selected Speed Dials may appear in one or more groups. Deleting the speed dials will remove them from the Group(s).";
HSDFPB_DeleteMultipleIndividualEntriesAlertMessage = "Some of the selected contacts may appear in one or more groups. Deleting the contacts will remove them from all groups.";

HSDFSD_DeleteGroupEntryAlertTitle = "Are you sure you want to delete the Speed Dial Group \"%@\"?";
HSDFPB_DeleteGroupEntryAlertTitle = "Are you sure you want to delete the group \"%@\"?";
HSDFSD_DeleteGroupEntryAlertMessage = "Individual Speed Dials within the selected Group will NOT be deleted.";
HSDFPB_DeleteGroupEntryAlertMessage = "The individual contacts that are in the group will NOT be deleted.";
HSDFSD_DeleteMultipleGroupEntriesAlertTitle = "Are you sure you want to delete the selected Speed Dial Groups?";
HSDFPB_DeleteMultipleGroupEntriesAlertTitle = "Are you sure you want to delete the selected groups?";
HSDFSD_DeleteMultipleGroupEntriesAlertMessage = "Individual Speed Dials within the selected Groups will NOT be deleted.";
HSDFPB_DeleteMultipleGroupEntriesAlertMessage = "The individual contacts that are in the groups will NOT be deleted.";

HSDFSD_DeleteIndividualEntryFromGroupAlertTitle = "Are you sure you want to remove the Speed Dial for \"%1$@\" from Group \"%2$@\"?";
HSDFPB_DeleteIndividualEntryFromGroupAlertTitle = "Are you sure you want to remove the contact \"%1$@\" from the group \"%2$@\"?";
HSDFSD_DeleteIndividualEntryFromGroupAlertMessage = "Clicking Remove from Group will only remove the Speed Dial from the group. The Speed Dial will not be deleted.\nClick Delete if you want to permanently delete the Speed Dial and remove it from any groups.";
HSDFPB_DeleteIndividualEntryFromGroupAlertMessage = "Clicking Remove from Group will only remove the Speed Dial from the group. The Speed Dial itself will not be deleted.\nClick Delete if you want to permanently delete the Speed Dial and remove it from all groups.";
HSDFSD_DeleteMultipleEntriesFromGroupAlertTitle = "Are you sure you want to remove the selected Speed Dials from Group \"%@\"?";
HSDFPB_DeleteMultipleEntriesFromGroupAlertTitle = "Are you sure you want to remove the selected contacts from the group \"%@\"?";
HSDFSD_DeleteMultipleEntriesFromGroupAlertMessage = "Clicking Remove from Group will only remove the Speed Dials from the group. The Speed Dials will not be deleted.\nClick Delete if you want to permanently delete the selected Speed Dials and remove them from any groups.";
HSDFPB_DeleteMultipleEntriesFromGroupAlertMessage = "Clicking Remove from Group will only remove the Speed Dials from the group. The Speed Dials themselves will not be deleted.\nClick Delete if you want to permanently delete the selected Speed Dials and remove them from all groups.";
HSDFSD_DeleteMultipleEntriesFromMultipleGroupsAlertTitle = "Are you sure you want to remove the selected Speed Dials from their respective Groups?";
HSDFPB_DeleteMultipleEntriesFromMultipleGroupsAlertTitle = "Are you sure you want to remove the selected contacts from their respective groups?";
HSDFSD_DeleteMultipleEntriesFromMultipleGroupsAlertMessage = "Clicking Remove from Group will only remove the Speed Dials from their groups. The Speed Dials will not be deleted.\nClick Delete if you want to permanently delete the Speed Dials and remove them from any groups.";
HSDFPB_DeleteMultipleEntriesFromMultipleGroupsAlertMessage = "Clicking Remove from Group will only remove the Speed Dials from their groups. The Speed Dials themselves will not be deleted.\nClick Delete if you want to permanently delete the Speed Dials and remove them from all groups.";

HSDFSD_DeleteMixedEntriesAlertTitle = "Are you sure you want to delete the selected Speed Dial(s) and Speed Dial Group(s)?";
HSDFPB_DeleteMixedEntriesAlertTitle = "Are you sure you want to delete the selected contacts and groups?";
HSDFSD_DeleteMixedEntriesAlertMessage = "Clicking Delete will permanently delete the selected individual Speed Dial(s) and Group(s). Individual Speed Dials within the selected Group(s) will NOT be deleted unless it is selected individually for deletion.";
HSDFPB_DeleteMixedEntriesAlertMessage = "Clicking Delete will permanently delete only those contacts and groups that are selected. Individual contacts that are in the selected groups but have not been directly selected themselves will NOT be deleted.";

DenyContactsAccessAlertTitle = "Information unavailable";
DenyContactsAccessAlertMessage = "No access to the \"%@\" application.\nYou can unblock it via the System Preferences, Security & Privacy panel.";

HSDFSD_AllowsToCommitChangesAlertTitle = "You have edited the fax speed dials list";
HSDFPB_AllowsToCommitChangesAlertTitle = "You have edited the fax phone book. Do you want to save your changes before printing?";
AllowsToCommitChangesAlertMessage = "The changes you've made will not be included in the printed list, if you do not apply them. Do you want to apply the changes you've made to the list, before printing it?";

/* Progress dialogs. */
PrintInitializingDialogTitle = "Processing…";
PrintProcessingDialogTitle = "Printing… Please wait";
